Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.SetHookPlaneNormalForBarIdx(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
Set the normal of plane in which the hook at end of bar with index barPositionIndex will stay. This information is set to the rebar after the API execution is finished successfully.
Remarks:
This information is set to the rebar after the API execution is finished successfully. Before setting the value a validation will be done.
We consider a hook plane normal valid if it's perpendicular with the bar direction at end.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
Index of the bar for which it will set hook plane normal.
hookNormal:
The normal of plane in which the hook at end of bar with index barPositionIndex will stay.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
-or-
hookNormal has zero length.
Since:
2018